app/controllers/locations_controller.rb

  def index
    respond_to do |format|
      format.html
      format.ics do
        headers['Content-Disposition'] = "attachment"
        render :text => Net::HTTP.get(URI(Location.feed.url)), :content_type => 'text/calendar'
---
SELECT "locations".* FROM "locations"